package DAY01;

public class Play01_self {

	public static void main(String[] args) {
		int camelNumber = 3;
		System.out.println(camelNumber);

		// 캐멀 케이스 : 두번째 단어부터 대문자
		// 파스칼 케이스 : 앞자리가 다 대문자이다.
		// 케밥 케이스 : 단어 사이에 (-) 하이픈을 넣어 표기
		// 스네이크 케이스 : simple_example (단어 사이에 (_) 언더스코어를 넣어 표기
		// 데이터 베이스에서는 보통 대소문자 구분을 안하기때문에 _ 언더스코어를 쓰기도 한다.

		// 변수 명명 규칙
		// 영문자(대소문자), 한글, 숫자, 언더바(_), 달러($)로만 구성 가능
		// 변수 이름은 숫자로 시작 불가능
		// 변수 사이에는 공백을 포함할 수 없다
		// 변수의 이름으로 자바에서 미리 정의된 키워드는 사용할 수 없다 (예약어)

		// 상수란?
		// 프로그램이 실행되는 동안 변하지 않는 값
		// 선언 시 값을 대입해야 함
		// '항상 같은 수'

	}

}
